{
  "name": "هادي احمد هادي",
  "sections": {
    "about": "عن",
    "workExperience": "خبرات العمل",
    "education": "التعليم",
    "certifications": "الشهادات",
    "publications": "Publications",
    "skills": "المهارات",
    "projects": "المشاريع"
  },
  "about": "مطور مواقع الكترونية",
  "summary": "مطور ويب  ذو خبرة تزيد عن 8 سنوات في تصميم وتطوير تطبيقات ويب ديناميكية عالية الأداء. متمكن من React وNext.js وExpress.js وTailwind CSS وZod وZustand وElectron.js. سجل حافل في بناء حلول واسعة النطاق   عبر الصناعات، بما في ذلك منصات مؤتمرات الفيديو والتجارة الإلكترونية متعددة المستأجرين وأنظمة السجلات الطبية الإلكترونية وحلول الدفع الإلكتروني ومنصات الاتصالات كخدمة. شغوف بتقديم تصميمات بديهية تركز على المستخدم مع التركيز على الأداء وقابلية التوسع والترميز النظيف. back-end  للموقع بالإضافة إلى front-end  مع بعض المهارات في مجموعة واسعة من مجالات البرمجة، من قواعد البيانات إلى التصميم الابداعي وإدارة UI/UX وكتابة التعليمات البرمجية النظيفة",
  "education": {
    "degree": {
      "school": "معهد التيمت",
      "degree": "virtualization and containerization application using docker and vmware "
    },
    "bachelor": {
      "school": "جامعة صنعاء",
      "degree": "بكالوريوس - علوم حاسوب "
    },
    "master": {
      "school": "اكاديمية رواد",
      "degree": "مخيم تطوير الويب"
    },

    "dibloma": {
      "school": "معهد ازار ",
      "degree": "Mobile Development (kotlien)"
    }
  },

  "work": {
    "sohobcom": {
      "title": "مطور ويب",
      "description": {
        "1": "إعداد واجهة المستخدم/تجربة المستخدم وإجراء الأبحاث لفهم احتياجات المستخدم وتفضيلاته وسلوكياته ونقاط الضعف.",
        "2": "إنشاء نماذج أولية لتصور واختبار أفكار ومفاهيم التصميم.",
        "3": " ترجمة النماذج  لتصميم واجهة المستخدم/تجربة المستخدم إلى كود برمجي، مما يضمن تنفيذ التصميم بدقة في المنتج النهائي.",
        "4": "تحسين أداء مواقع الويب عن طريق تقليل أحجام الملفات وتقليل طلبات HTTP وتنفيذ أفضل ممارسات الأداء الأخرى.",
        "5": "التأكد من أن مواقع الويب تعمل بشكل متسق عبر المتصفحات المختلفة (مثل Chrome وFirefox وSafari وEdge) عن طريق اختبار التعليمات البرمجية وتصحيح الأخطاء.",
        "6": "التأكد من إمكانية الوصول إلى مواقع الويب للمستخدمين ذوي الإعاقة، من خلال اتباع معايير وإرشادات إمكانية الوصول إلى الويب (مثل WCAG).",
        "7": "بناء api وربطها مع الواجهات"
      }
    },
    "poqsha": {
      "title": "Full Stack Developer",
      "description": {
        "1": "تم تطوير حل للتجارة الإلكترونية متعدد المستأجرين قابل للتوسع، مما يمكّن الشركات من إنشاء وإدارة متاجرها الإلكترونية بسهولة.",
        "2": "تم تصميم وتنفيذ لوحات تحكم قابلة للتخصيص، وأنظمة إدارة منتجات قوية، ودمج بوابات الدفع الآمنة، مع تمكين كل مستأجر من تطوير وإدارة السمات الخاصة به.",
        "3": "سمحت هذه الوظيفة للمستأجرين بتخصيص مظهر وشعور متاجرهم، مما يوفر تجربة تسوق مخصصة وسلسة وجذابة بصريًا.",
        "4": "تحسين أداء التجارة الإلكترونية عن طريق تقليل أحجام الملفات، وتقليل طلبات HTTP، وتنفيذ أفضل ممارسات الأداء الأخرى."
      }
    },
    "teleyemen": {
      "title": "مطور ويب",
      "description": {
        "1": "إنشاء واجهة جذابة بصريًا وسهلة الاستخدام لمواقع الويب وتطبيقات الويب. ويتضمن ذلك ترجمة نماذج التصميم   إلى صفحات ويب تفاعلية.",
        "2": " التأكد من استجابة الموقع أو التطبيق وعمله عبر المتصفحات والأجهزة المختلفة. ",
        "3": "العمل بشكل وثيق مع المصممين ومطوري الواجهة الخلفية لدمج كود الواجهة الأمامية مع الأنظمة الخلفية."
      }
    },
    "sinyar": {
      "title": " front-end developer",
      "description": {
        "1": "تطوير  sinyar موقع.",
        "2": "تطوير منصة خاصة لادارة المحتوى ونشر المدونات"
      }
    },
    "waslpay": {
      "title": "Full Stack Developer",
      "description": {
        "1": "تطوير موقع يقدم حلول الدفع الإلكتروني حيث يمكن للتجار أو أصحاب المتاجر الإلكترونية استلام المدفوعات من خلال تسهيل عملية الدفع الإلكتروني لزوار الموقع والعملاء المحتملين -- يستطيع التاجر متابعة مبيعات متجره وكذلك فواتير المبيعات والمحاسبة إدخالات لكل معاملة مالية و --الرصيد وكذلك تحويل الأموال إلى حسابات أخرى --يمكن للعميل الاطلاع على رصيد البنك وكذلك مشترياته من المتاجر الإلكترونية وفواتير المشتريات وكذلك حسابات تحويل الأموال بين الحسابات ."
      }
    },
    "MAS": {
      "title": "Full Stack Developer",
      "description": {
        "1": "تطوير تطبيق ويب لإدارة السجلات الطبية الإلكترونية للمؤسسات والذي يغطي جميع جوانب إدارة المستشفيات اليومية من البداية إلى النهاية."
      }
    }
  },
  "projects": {
    "poqsha": {
      "title": "Poqsha للتجارة الإلكترونية متعددة المستأجرين",
      "description": "تم بناء حل متعدد المستأجرين يمكّن الشركات من إنشاء وإدارة متاجر التجارة الإلكترونية. تم تنفيذ لوحات تحكم مخصصة، وإدارة المنتجات، وبوابات الدفع لكل مستأجر."
    },
    "learning": {
      "title": "منصة المؤتمرات المرئية (SohobMeet)",
      "description": "تم تطوير منصة SohobMeet للمؤتمرات المرئية، باستخدام WebRTC لتحقيق تواصل صوتي ومرئي في الوقت الفعلي بشكل سلس. تم دمج العديد من واجهات البرمجة (APIs) لتمكين ميزات متقدمة مثل مشاركة الشاشة، وغرف الانفصال، والدردشة. تم بناء المنصة باستخدام Next.js و TypeScript لتحقيق أداء محسن وقابلية التوسع."
    },
    "blog": {
      "title": "SohobCom موقع ",
      "description": "SohobCom موقع.  php and laravel"
    },

    "waslpay": {
      "title": "بوابة دفع الكترونية",
      "description": "موقع يقدم خدمات الدفع الإلكتروني:html5 , css3 , js,php,laravel"
    }
  },
  "switcher": {
    "label": "تغيير اللغة",
    "en": "الانجليزية",
    "ar": "العربية"
  },
  "present": "حاليا",
  "seeMore": "رؤية المزيد",
  "seeLess": "عرض اقل"
}
