{
  "name": "Hadi ahmed hadi",
  "sections": {
    "about": "About",
    "workExperience": "Work Experience",
    "education": "Education",
    "certifications": "Certifications",
    "publications": "Publications",
    "skills": "Skills",
    "projects": "Projects"
  },
  "about": "Full Stack Developer",
  "summary": "Experienced Senior Web Developer with over 8 years of expertise in designing and developing dynamic, high-performance web applications. Proficient in React, Next.js, Express.js, Tailwind CSS, Zod, Zustand, and Electron.js. Proven track record in building large-scale, enterprise-level solutions across industries, including video conferencing platforms, multi-tenant e-commerce, electronic medical records (EMR) systems, electronic payment solutions, and communication-as-a-service platforms. Passionate about delivering intuitive, user-centered designs with a focus on performance, scalability, and clean code.",
  "education": {
    "bachelor": {
      "school": "Sana'a University",
      "degree": "Bachelor Degree - Computer Science "
    },
    "master": {
      "school": "Rowad Coding Academy Bootcamp",
      "degree": "Web Full Stack development"
    },
    "degree": {
      "school": "ultimate Institute",
      "degree": "virtualization and containerization application using docker and vmware "
    },
    "dibloma": {
      "school": "Azar ",
      "degree": "Mobile Development (kotlien)"
    }
  },
  "work": {
    "sohobcom": {
      "title": "Full Stack Developer",
      "description": {
        "1": "prepare UI/Ux And conducting research to understand user needs, preferences, behaviors, and pain points.",
        "2": "Creating wireframes and prototypes to visualize and test design ideas and concepts.",
        "3": " translating UI/UX design wireframes into code, ensuring that the design is accurately implemented in the final product.",
        "4": "optimize the performance of websites by minimizing file sizes, reducing HTTP requests, and implementing other performance best practices.",
        "5": "Ensuring that websites work consistently across different browsers (such as Chrome, Firefox, Safari, and Edge) by testing and debugging code.",
        "6": "Making sure that websites are accessible to users with disabilities, by following web accessibility standards and guidelines (such as WCAG).",
        "7": "build api and integrate with front end."
      }
    },
    "poqsha": {
      "title": "Full Stack Developer",
      "description": {
        "1": "Developed a scalable multi-tenant e-commerce solution, empowering businesses to effortlessly create and manage their own online stores. ",
        "2": "Designed and implemented customizable dashboards, robust product management systems, secure payment gateway integrations, and the ability for each tenant to develop and manage their own themes.",
        "3": "This functionality allowed tenants to tailor the look and feel of their stores, providing a personalized, seamless, and visually engaging shopping experience.",
        "4": "optimize the performance of e-commerce by minimizing file sizes, reducing HTTP requests, and implementing other performance best practices."
      }
    },
    "teleyemen": {
      "title": "Full Stack Developer",
      "description": {
        "1": "create a visually appealing and user-friendly interface for websites and web applications. This involves translating design mock-ups and wireframes into interactive web pages. ",
        "2": " ensuring that the website or application is responsive and works across different browsers and devices. ",
        "3": "work closely with designers and back-end developers to integrate the front-end code with the back-end systems."
      }
    },
    "sinyar": {
      "title": "full stack developer",
      "description": {
        "1": "development of the sinyar portfolio.",
        "2": "development of the sinyar cms and bloging platform."
      }
    },

    "waslpay": {
      "title": "Full Stack Developer",
      "description": {
        "1": "develope website that offers electronic payment solutions where merchants or owners of electronic stores can receive payments by facilitating the electronic payment process for site visitors and potential customers --The merchant can follow up on the sales of his store, as well as sales invoices and accounting entries for each financial transaction and --the balance, as well as transferring money to other accounts --The customer can view the bank balance as well as his purchases from electronic stores and purchase invoices, as well as the calculations for transferring money between accounts."
      }
    },
    "MAS": {
      "title": "Full Stack Developer",
      "description": {
        "1": "development of EMR enterprise web-based application which covers all day to day aspects of Hospital management end to end."
      }
    }
  },
  "projects": {
    "poqsha": {
      "title": "Poqsha multi-tenant e-commerce",
      "description": "Built a multi-tenant solution enabling businesses to create and manage e-commerce stores. Implemented customdashboards, product management, and payment gateways for each tenant."
    },
    "learning": {
      "title": "Video Conferencing Platform (SohobMeet)",
      "description": "Developed the SohobMeet video conferencing platform, leveraging WebRTC for seamless real-time audio and video communication. Integrated multiple APIs to enable advanced features such as screen sharing, breakout rooms, and chat. The platform was built using Next.js and TypeScript for optimized performance and scalability."
    },
    "blog": {
      "title": "SohobCom Website",
      "description": "SohobCom website and blog. Built with php and laravel"
    },

    "waslpay": {
      "title": "Wasl Payment Gateway",
      "description": "website that provides electronic payment services used:html5 , css3 , js,php,laravel"
    }
  },
  "switcher": {
    "label": "Change language",
    "en": "English",
    "ar": "arabic"
  },
  "present": "Present",
  "seeMore": "See more",
  "seeLess": "See less"
}
